tutorials/suspensionFoam/RAS/duneTransport/profilesInlet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

// * * * * * * * * * * * * sediment properties * * * * * * * * * * * * //

rhoS    [1 -3 0 0 0 0 0] 2600; // sediment density

dS      [0 1 0 0 0 0 0] 0.4e-3; // sediment diameter

Cmax    [0 0 0 0 0 0 0] 0.6; // max volumic sediment concentration

// ************************************************************************* //

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;

Sc      1; // Schmidt number

// ************************************************************************* //
