tutorials/suspensionFoam/RAS/duneTransport/profilesInlet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1e-3;


height       90;
dx           1;
dy           6.03;

nz           64;
gz           15;

vertices        
(

    (0 0 0)  // 0
    ($dx 0 0)  // 1
    ($dx $dy 0)  // 2
    (0 $dy 0)  // 3

    (0 0 $height)  // 4
    ($dx 0 $height)  // 5
    ($dx $dy $height)  // 6
    (0 $dy $height)  // 7

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (1 1 $nz) simpleGrading (1 1 $gz)
);

edges           
(
);

boundary         
(
    inlet
    {
     type           cyclic;
     neighbourPatch outlet;
     faces
         (
             (0 4 7 3)
         );
    }
    outlet
    {
     type            cyclic;
     neighbourPatch  inlet;
     faces
         (
             (1 2 6 5)
         );
    }
    top
    {
        type    wall;
        faces
            (
                (4 5 6 7)
            );
    }
    bed
    {
     type wall;
     faces
         (
             (3 2 1 0)
         );
    }
    sides
    {
    type empty;
    faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
